99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_memory.c
#include "esp32_mquickjs_memory.h"

#include <limits.h>
#include <string.h>

#include "sdkconfig.h"
#include "esp_heap_caps.h"
#include "esp_memory_utils.h"
#include "esp_psram.h"
#include "freertos/FreeRTOS.h"
#include "freertos/portmacro.h"
#include "soc/soc_caps.h"

#define MEMORY_MIN_INTERNAL_RESERVE_BYTES (16U * 1024U)
#define MEMORY_MAX_INTERNAL_RESERVE_BYTES (64U * 1024U)
#define MEMORY_MIN_DMA_RESERVE_BYTES (8U * 1024U)
#define MEMORY_MAX_DMA_RESERVE_BYTES (32U * 1024U)
#define MEMORY_LARGE_DEFAULT_BYTES 4096U
#define MEMORY_MAX_ACTIONS_PER_PASS 4U

_Static_assert(CONFIG_ESP32_MQUICKJS_WIRELESS_CONTROL_RESERVE_BYTES <=
    CONFIG_ESP32_MQUICKJS_WIRELESS_INTERNAL_BUDGET_BYTES,
    "wireless control reserve exceeds internal quota");

struct esp32_mquickjs_memory_block {
    struct esp32_mquickjs_memory_block *next;
    void *data;
    size_t size;
    const char *owner;
    esp32_mquickjs_memory_class_t memory_class;
    esp32_mquickjs_memory_relocated_fn relocated;
    void *opaque;
    uint64_t last_used;
    uint16_t borrows;
    bool external;
    bool transitioning;
};

typedef struct esp32_mquickjs_memory_payload {
    struct esp32_mquickjs_memory_payload *next;
    void *data;
    size_t size;
    const char *owner;
    esp32_mquickjs_memory_class_t memory_class;
    bool external;
    bool transitioning;
    uint8_t budget_role;
    bool metadata_external;
} esp32_mquickjs_memory_payload_t;

typedef struct {
    portMUX_TYPE lock;
    esp32_mquickjs_memory_block_t *blocks;
    esp32_mquickjs_memory_payload_t *payloads;
    size_t internal_reserve_bytes;
    size_t dma_largest_reserve_bytes;
    size_t managed_internal_bytes;
    size_t managed_psram_bytes;
    size_t managed_pinned_bytes;
    esp32_mquickjs_memory_owner_accounting_t owner_accounting;
    esp32_mquickjs_memory_dma_accounting_t dma_accounting;
    esp32_mquickjs_memory_budget_t wireless;
    uint64_t use_sequence;
    uint32_t migration_count;
    size_t migration_bytes;
    uint32_t eviction_count;
    uint32_t allocation_failures;
    bool initialized;
    bool maintaining;
} esp32_mquickjs_memory_manager_t;

static esp32_mquickjs_memory_manager_t s_memory = {
    .lock = portMUX_INITIALIZER_UNLOCKED,
};

static size_t memory_clamp(size_t value, size_t minimum, size_t maximum)
{
    if (value < minimum) {
        return minimum;
    }
    return value > maximum ? maximum : value;
}

static bool memory_has_psram(void)
{
#ifdef CONFIG_SPIRAM
    return esp_psram_is_initialized() &&
           heap_caps_get_total_size(MALLOC_CAP_SPIRAM) > 0;
#else
    return false;
#endif
}

static bool memory_has_external_dma(void)
{
#if SOC_PSRAM_DMA_CAPABLE
    /*
     * External DMA is a SoC capability, not a heap capability intersection.
     * ESP-IDF intentionally registers PSRAM without MALLOC_CAP_DMA and adjusts
     * SPIRAM|DMA requests in the capability allocator.
     */
    return memory_has_psram();
#else
    return false;
#endif
}

static bool memory_is_external(const void *data)
{
    return data != NULL && esp_ptr_external_ram(data);
}

static uint8_t memory_region_for_external(bool external)
{
    return external ? ESP32_MQUICKJS_MEMORY_REGION_PSRAM
                    : ESP32_MQUICKJS_MEMORY_REGION_INTERNAL;
}

static esp32_mquickjs_memory_class_t memory_owner_class(
    esp32_mquickjs_memory_class_t memory_class,
    bool external)
{
    if (memory_class == ESP32_MQUICKJS_MEMORY_DEFAULT) {
        return external ? ESP32_MQUICKJS_MEMORY_EXTERNAL
                        : ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL;
    }
    if (memory_class == ESP32_MQUICKJS_MEMORY_DMA_EXTERNAL && !external) {
        return ESP32_MQUICKJS_MEMORY_DMA_INTERNAL;
    }
    return memory_class;
}

static void memory_note_failure(void)
{
    taskENTER_CRITICAL(&s_memory.lock);
    if (s_memory.allocation_failures != UINT32_MAX) {
        s_memory.allocation_failures++;
    }
    taskEXIT_CRITICAL(&s_memory.lock);
}

static void memory_heap_info(multi_heap_info_t *internal,
                             multi_heap_info_t *dma)
{
    memset(internal, 0, sizeof(*internal));
    memset(dma, 0, sizeof(*dma));
    heap_caps_get_info(internal, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    heap_caps_get_info(
        dma, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
}

static esp32_mquickjs_memory_pressure_t memory_pressure_now(void)
{
    multi_heap_info_t internal;
    multi_heap_info_t dma;
    size_t internal_reserve;
    size_t dma_reserve;

    memory_heap_info(&internal, &dma);
    taskENTER_CRITICAL(&s_memory.lock);
    internal_reserve = s_memory.internal_reserve_bytes;
    dma_reserve = s_memory.dma_largest_reserve_bytes;
    taskEXIT_CRITICAL(&s_memory.lock);

    if (internal.total_free_bytes < internal_reserve / 2U ||
        dma.largest_free_block < dma_reserve / 2U) {
        return ESP32_MQUICKJS_MEMORY_PRESSURE_CRITICAL;
    }
    if (internal.total_free_bytes < internal_reserve ||
        dma.largest_free_block < dma_reserve) {
        return ESP32_MQUICKJS_MEMORY_PRESSURE_GUARDED;
    }
    return ESP32_MQUICKJS_MEMORY_PRESSURE_NORMAL;
}

static bool memory_internal_dma_can_fit(size_t request_bytes)
{
    multi_heap_info_t internal;
    multi_heap_info_t dma;
    size_t reserve;
    size_t pending_bytes;
    size_t pending_largest_bytes;
    size_t required_bytes;
    size_t required_largest;

    memory_heap_info(&internal, &dma);
    taskENTER_CRITICAL(&s_memory.lock);
    reserve = s_memory.internal_reserve_bytes;
    pending_bytes = s_memory.dma_accounting.pending_bytes;
    pending_largest_bytes = s_memory.dma_accounting.pending_largest_bytes;
    taskEXIT_CRITICAL(&s_memory.lock);
    if (request_bytes > SIZE_MAX - pending_bytes ||
        request_bytes > SIZE_MAX - pending_largest_bytes) {
        return false;
    }
    required_bytes = request_bytes + pending_bytes;
    required_largest = request_bytes + pending_largest_bytes;
    return dma.largest_free_block >= required_largest &&
           internal.total_free_bytes >= required_bytes &&
           internal.total_free_bytes - required_bytes >= reserve / 2U;
}

static bool memory_internal_can_fit(size_t request_bytes)
{
    multi_heap_info_t internal;
    multi_heap_info_t dma;
    size_t reserve;
    size_t pending_bytes;
    size_t required_bytes;

    memory_heap_info(&internal, &dma);
    taskENTER_CRITICAL(&s_memory.lock);
    reserve = s_memory.internal_reserve_bytes;
    pending_bytes = s_memory.dma_accounting.pending_bytes;
    taskEXIT_CRITICAL(&s_memory.lock);
    if (request_bytes > SIZE_MAX - pending_bytes) {
        return false;
    }
    required_bytes = request_bytes + pending_bytes;
    return internal.largest_free_block >= request_bytes &&
           internal.total_free_bytes >= required_bytes &&
           internal.total_free_bytes - required_bytes >= reserve / 2U;
}

