99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_memory.c
void esp32_mquickjs_memory_init(void)
{
    multi_heap_info_t internal;
    multi_heap_info_t dma;

    memory_heap_info(&internal, &dma);
    taskENTER_CRITICAL(&s_memory.lock);
    if (s_memory.initialized) {
        taskEXIT_CRITICAL(&s_memory.lock);
        return;
    }
    s_memory.internal_reserve_bytes = memory_clamp(
        internal.total_free_bytes / 5U,
        MEMORY_MIN_INTERNAL_RESERVE_BYTES,
        MEMORY_MAX_INTERNAL_RESERVE_BYTES);
    s_memory.dma_largest_reserve_bytes = memory_clamp(
        dma.largest_free_block / 2U,
        MEMORY_MIN_DMA_RESERVE_BYTES,
        MEMORY_MAX_DMA_RESERVE_BYTES);
    (void)esp32_mquickjs_memory_budget_init(&s_memory.wireless,
        CONFIG_ESP32_MQUICKJS_WIRELESS_INTERNAL_BUDGET_BYTES,
        CONFIG_ESP32_MQUICKJS_WIRELESS_PSRAM_BUDGET_BYTES,
        CONFIG_ESP32_MQUICKJS_WIRELESS_CONTROL_RESERVE_BYTES);
    s_memory.initialized = true;
    taskEXIT_CRITICAL(&s_memory.lock);
}

static void *memory_alloc_once(size_t size,
                               esp32_mquickjs_memory_class_t memory_class,
                               bool zero)
{
    bool has_psram = memory_has_psram();
    bool has_external_dma = memory_has_external_dma();
    bool guarded = memory_pressure_now() !=
                   ESP32_MQUICKJS_MEMORY_PRESSURE_NORMAL;
    void *data = NULL;

    if (size == 0) {
        size = 1;
    }
    switch (memory_class) {
    case ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL:
        if (memory_internal_can_fit(size)) {
            data = heap_caps_malloc(size,
                                    MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        }
        break;
    case ESP32_MQUICKJS_MEMORY_DMA_INTERNAL:
        if (memory_internal_dma_can_fit(size)) {
            data = heap_caps_malloc(
                size, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
        }
        break;
    case ESP32_MQUICKJS_MEMORY_DMA_EXTERNAL:
        if (has_external_dma) {
            data = heap_caps_malloc(
                size, MALLOC_CAP_SPIRAM | MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
            if (data != NULL && !esp_ptr_dma_ext_capable(data)) {
                heap_caps_free(data);
                data = NULL;
            }
        }
        if (data == NULL && memory_internal_dma_can_fit(size)) {
            data = heap_caps_malloc(
                size, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
        }
        break;
    case ESP32_MQUICKJS_MEMORY_EXTERNAL:
    case ESP32_MQUICKJS_MEMORY_COLD_MOVABLE:
    case ESP32_MQUICKJS_MEMORY_CACHE_EVICTABLE:
        if (has_psram) {
            data = heap_caps_malloc(size,
                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        } else if (memory_internal_can_fit(size)) {
            data = heap_caps_malloc(size, MALLOC_CAP_8BIT);
        }
        break;
    case ESP32_MQUICKJS_MEMORY_HOT_MOVABLE:
        if (has_psram && guarded) {
            data = heap_caps_malloc(size,
                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        }
        if (data == NULL) {
            data = heap_caps_malloc(size,
                                    MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        }
        if (data == NULL && has_psram) {
            data = heap_caps_malloc(size,
                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        }
        break;
    case ESP32_MQUICKJS_MEMORY_DEFAULT:
    default:
        if (has_psram && (guarded || size >= MEMORY_LARGE_DEFAULT_BYTES)) {
            data = heap_caps_malloc(size,
                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        }
        if (data == NULL) {
            data = heap_caps_malloc(size, MALLOC_CAP_8BIT);
        }
        break;
    }
    if (data != NULL && zero) {
        memset(data, 0, size);
    }
    return data;
}

static void *memory_alloc_classified(size_t size,
                                     esp32_mquickjs_memory_class_t memory_class,
                                     bool zero)
{
    void *data;

    esp32_mquickjs_memory_init();
    data = memory_alloc_once(size, memory_class, zero);
    if (data == NULL) {
        memory_note_failure();
    }
    return data;
}

static uint32_t memory_realloc_caps(
    esp32_mquickjs_memory_class_t memory_class,
    size_t size)
{
    bool has_psram = memory_has_psram();

    switch (memory_class) {
    case ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL:
        return MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT;
    case ESP32_MQUICKJS_MEMORY_DMA_INTERNAL:
        return MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA | MALLOC_CAP_8BIT;
    case ESP32_MQUICKJS_MEMORY_DMA_EXTERNAL:
        return memory_has_external_dma()
                   ? MALLOC_CAP_SPIRAM | MALLOC_CAP_DMA | MALLOC_CAP_8BIT
                   : MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA | MALLOC_CAP_8BIT;
    case ESP32_MQUICKJS_MEMORY_EXTERNAL:
    case ESP32_MQUICKJS_MEMORY_COLD_MOVABLE:
    case ESP32_MQUICKJS_MEMORY_CACHE_EVICTABLE:
        return has_psram ? MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT
                         : MALLOC_CAP_8BIT;
    case ESP32_MQUICKJS_MEMORY_HOT_MOVABLE:
        return has_psram && memory_pressure_now() !=
                                ESP32_MQUICKJS_MEMORY_PRESSURE_NORMAL
                   ? MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT
                   : MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT;
    case ESP32_MQUICKJS_MEMORY_DEFAULT:
    default:
        return has_psram && size >= MEMORY_LARGE_DEFAULT_BYTES
                   ? MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT
                   : MALLOC_CAP_8BIT;
    }
}

static void *memory_realloc_classified(
    void *data,
    size_t size,
    esp32_mquickjs_memory_class_t memory_class)
{
    void *next;
    uint32_t caps;
    bool external_dma_class;
    bool retry_internal_dma;

    esp32_mquickjs_memory_init();
    external_dma_class =
        memory_class == ESP32_MQUICKJS_MEMORY_DMA_EXTERNAL;
    retry_internal_dma = external_dma_class && memory_has_external_dma();
    if (memory_class == ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL &&
        size != 0 && !memory_internal_can_fit(size)) {
        memory_note_failure();
        return NULL;
    }
    if (memory_class == ESP32_MQUICKJS_MEMORY_DMA_INTERNAL &&
        size != 0 && !memory_internal_dma_can_fit(size)) {
        memory_note_failure();
        return NULL;
    }
    if (external_dma_class && !retry_internal_dma && size != 0 &&
        !memory_internal_dma_can_fit(size)) {
        memory_note_failure();
        return NULL;
    }
    caps = memory_realloc_caps(memory_class, size);
    next = heap_caps_realloc(data, size, caps);
    if (next == NULL && size != 0 && retry_internal_dma &&
        memory_internal_dma_can_fit(size)) {
        next = heap_caps_realloc(
            data, size,
            MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
    }
    if (next == NULL && size != 0) {
        memory_note_failure();
    }
    return next;
}

static bool memory_account_add_locked(
    const char *owner,
    esp32_mquickjs_memory_class_t memory_class,
    bool external,
    size_t size)
{
    esp32_mquickjs_memory_class_t owner_class =
        memory_owner_class(memory_class, external);

    if (!esp32_mquickjs_memory_owner_add(
            &s_memory.owner_accounting, owner, (uint8_t)owner_class,
            memory_region_for_external(external), size, 1)) {
        return false;
    }
    if (external) {
        s_memory.managed_psram_bytes += size;
    } else {
        s_memory.managed_internal_bytes += size;
        if (owner_class != ESP32_MQUICKJS_MEMORY_HOT_MOVABLE &&
            owner_class != ESP32_MQUICKJS_MEMORY_COLD_MOVABLE &&
            owner_class != ESP32_MQUICKJS_MEMORY_CACHE_EVICTABLE) {
            s_memory.managed_pinned_bytes += size;
        }
    }
    return true;
}

static bool memory_account_remove_locked(
    const char *owner,
    esp32_mquickjs_memory_class_t memory_class,
    bool external,
    size_t size)
{
    esp32_mquickjs_memory_class_t owner_class =
        memory_owner_class(memory_class, external);

