99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_memory.c
    if (!esp32_mquickjs_memory_owner_remove(
            &s_memory.owner_accounting, owner, (uint8_t)owner_class,
            memory_region_for_external(external), size, 1)) {
        return false;
    }
    if (external) {
        s_memory.managed_psram_bytes -= size;
    } else {
        s_memory.managed_internal_bytes -= size;
        if (owner_class != ESP32_MQUICKJS_MEMORY_HOT_MOVABLE &&
            owner_class != ESP32_MQUICKJS_MEMORY_COLD_MOVABLE &&
            owner_class != ESP32_MQUICKJS_MEMORY_CACHE_EVICTABLE) {
            s_memory.managed_pinned_bytes -= size;
        }
    }
    return true;
}

static esp32_mquickjs_memory_payload_t *memory_payload_metadata_alloc(void)
{
    esp32_mquickjs_memory_payload_t *payload = NULL;

    if (memory_has_psram()) {
        payload = heap_caps_calloc(
            1, sizeof(*payload), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    }
    if (payload == NULL) {
        payload = heap_caps_calloc(
            1, sizeof(*payload), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    return payload;
}

static void *memory_payload_alloc_tracked(
    const char *owner,
    size_t size,
    esp32_mquickjs_memory_class_t memory_class,
    bool zero)
{
    esp32_mquickjs_memory_payload_t *payload;
    void *data;
    size_t actual_size = size == 0 ? 1U : size;
    bool external;

    if (owner == NULL || owner[0] == '\0') {
        memory_note_failure();
        return NULL;
    }
    data = memory_alloc_classified(actual_size, memory_class, zero);
    if (data == NULL) {
        return NULL;
    }
    payload = memory_payload_metadata_alloc();
    if (payload == NULL) {
        heap_caps_free(data);
        memory_note_failure();
        return NULL;
    }
    external = memory_is_external(data);
    taskENTER_CRITICAL(&s_memory.lock);
    if (!memory_account_add_locked(owner, memory_class, external,
                                   actual_size)) {
        taskEXIT_CRITICAL(&s_memory.lock);
        heap_caps_free(payload);
        heap_caps_free(data);
        memory_note_failure();
        return NULL;
    }
    payload->next = s_memory.payloads;
    payload->data = data;
    payload->size = actual_size;
    payload->owner = owner;
    payload->memory_class = memory_class;
    payload->external = external;
    s_memory.payloads = payload;
    taskEXIT_CRITICAL(&s_memory.lock);
    return data;
}

static bool memory_wireless_bytes(size_t size, bool external,
    bool metadata_external, size_t bytes[2])
{
    bytes[0] = bytes[1] = 0;
    bytes[memory_region_for_external(external)] = size;
    uint8_t metadata_region = memory_region_for_external(metadata_external);
    if (bytes[metadata_region] > SIZE_MAX - sizeof(esp32_mquickjs_memory_payload_t))
        return false;
    bytes[metadata_region] += sizeof(esp32_mquickjs_memory_payload_t);
    return true;
}

static void memory_wireless_release(
    esp32_mquickjs_memory_budget_role_t role, const size_t bytes[2])
{
    taskENTER_CRITICAL(&s_memory.lock);
    (void)esp32_mquickjs_memory_budget_release(&s_memory.wireless, role, bytes);
    taskEXIT_CRITICAL(&s_memory.lock);
}

static void *memory_wireless_alloc_tracked(const char *owner, size_t size,
    esp32_mquickjs_memory_class_t memory_class,
    esp32_mquickjs_memory_budget_role_t role, bool zero)
{
    if (owner == NULL || owner[0] == '\0' ||
        role <= ESP32_MQUICKJS_MEMORY_BUDGET_NONE ||
        role >= ESP32_MQUICKJS_MEMORY_BUDGET_ROLE_COUNT ||
        role == ESP32_MQUICKJS_MEMORY_BUDGET_RETIRED_POOL ||
        (memory_class != ESP32_MQUICKJS_MEMORY_DEFAULT &&
         memory_class != ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL &&
         memory_class != ESP32_MQUICKJS_MEMORY_EXTERNAL)) {
        memory_note_failure();
        return NULL;
    }
    esp32_mquickjs_memory_init();
    size_t actual_size = size == 0 ? 1U : size;
    bool has_psram = memory_has_psram();
    bool prefer_external = has_psram &&
        (memory_class == ESP32_MQUICKJS_MEMORY_EXTERNAL ||
         (memory_class == ESP32_MQUICKJS_MEMORY_DEFAULT &&
          (actual_size >= MEMORY_LARGE_DEFAULT_BYTES ||
           memory_pressure_now() != ESP32_MQUICKJS_MEMORY_PRESSURE_NORMAL)));
    /* DEFAULT may try the other region; explicit policies retain their region.
     * Tracking nodes prefer PSRAM independently of the payload's placement. */
    unsigned attempts = has_psram && memory_class == ESP32_MQUICKJS_MEMORY_DEFAULT ? 2U : 1U;
    for (unsigned attempt = 0; attempt < attempts; ++attempt) {
        bool external = attempt == 0 ? prefer_external : !prefer_external;
        for (unsigned meta = 0; meta < (has_psram ? 2U : 1U); ++meta) {
            bool metadata_external = has_psram && meta == 0;
            size_t bytes[2];
            if (!memory_wireless_bytes(actual_size, external, metadata_external, bytes))
                continue;
            if (bytes[0] != 0 && !memory_internal_can_fit(bytes[0])) continue;
            taskENTER_CRITICAL(&s_memory.lock);
            bool admitted = esp32_mquickjs_memory_budget_reserve(
                &s_memory.wireless, role, bytes);
            taskEXIT_CRITICAL(&s_memory.lock);
            if (!admitted) continue;

            void *data = heap_caps_malloc(actual_size, MALLOC_CAP_8BIT |
                (external ? MALLOC_CAP_SPIRAM : MALLOC_CAP_INTERNAL));
            esp32_mquickjs_memory_payload_t *payload = data == NULL ? NULL :
                heap_caps_calloc(1, sizeof(*payload), MALLOC_CAP_8BIT |
                    (metadata_external ? MALLOC_CAP_SPIRAM : MALLOC_CAP_INTERNAL));
            if (payload != NULL) {
                if (zero) memset(data, 0, actual_size);
                taskENTER_CRITICAL(&s_memory.lock);
                bool accounted = memory_account_add_locked(owner, memory_class,
                    external, actual_size);
                if (accounted) {
                    payload->data = data;
                    payload->size = actual_size;
                    payload->owner = owner;
                    payload->memory_class = memory_class;
                    payload->external = external;
                    payload->metadata_external = metadata_external;
                    payload->budget_role = role;
                    payload->next = s_memory.payloads;
                    s_memory.payloads = payload;
                }
                taskEXIT_CRITICAL(&s_memory.lock);
                if (accounted) return data;
            }
            heap_caps_free(data);
            heap_caps_free(payload);
            memory_wireless_release(role, bytes);
        }
    }
    memory_note_failure();
    return NULL;
}

void *esp32_mquickjs_memory_wireless_alloc(const char *owner, size_t size,
    esp32_mquickjs_memory_class_t memory_class,
    esp32_mquickjs_memory_budget_role_t role)
{
    return memory_wireless_alloc_tracked(owner, size, memory_class, role, false);
}

void *esp32_mquickjs_memory_wireless_calloc(const char *owner, size_t count,
    size_t size, esp32_mquickjs_memory_class_t memory_class,
    esp32_mquickjs_memory_budget_role_t role)
{
    if (size != 0 && count > SIZE_MAX / size) {
        memory_note_failure();
        return NULL;
    }
    return memory_wireless_alloc_tracked(owner, count * size, memory_class, role, true);
}

bool esp32_mquickjs_memory_wireless_retire(void *data)
{
    bool retired = false;
    taskENTER_CRITICAL(&s_memory.lock);
    for (esp32_mquickjs_memory_payload_t *p = s_memory.payloads; p != NULL; p = p->next) {
        if (p->data != data) continue;
        if (p->transitioning) break;
        if (p->budget_role == ESP32_MQUICKJS_MEMORY_BUDGET_RETIRED_POOL) {
            retired = true;
        } else if (p->budget_role == ESP32_MQUICKJS_MEMORY_BUDGET_POOL) {
            size_t bytes[2];
            if (memory_wireless_bytes(p->size, p->external, p->metadata_external, bytes) &&
                esp32_mquickjs_memory_budget_retire(&s_memory.wireless, bytes)) {
                p->budget_role = ESP32_MQUICKJS_MEMORY_BUDGET_RETIRED_POOL;
                retired = true;
            }
        }
        break;
    }
    taskEXIT_CRITICAL(&s_memory.lock);
    return retired;
}

void *esp32_mquickjs_memory_payload_alloc(
    const char *owner,
    size_t size,
    esp32_mquickjs_memory_class_t memory_class)
{
    return memory_payload_alloc_tracked(owner, size, memory_class, false);
}

