99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_memory.c
void *esp32_mquickjs_memory_payload_calloc(
    const char *owner,
    size_t count,
    size_t size,
    esp32_mquickjs_memory_class_t memory_class)
{
    if (size != 0 && count > SIZE_MAX / size) {
        memory_note_failure();
        return NULL;
    }
    return memory_payload_alloc_tracked(
        owner, count * size, memory_class, true);
}

void *esp32_mquickjs_memory_payload_realloc(
    const char *owner,
    void *data,
    size_t size,
    esp32_mquickjs_memory_class_t memory_class)
{
    esp32_mquickjs_memory_payload_t *payload;
    void *next;
    size_t old_size;
    bool old_external;
    bool next_external;

    if (data == NULL) {
        return esp32_mquickjs_memory_payload_alloc(
            owner, size, memory_class);
    }
    if (size == 0) {
        esp32_mquickjs_memory_payload_free(data);
        return NULL;
    }
    taskENTER_CRITICAL(&s_memory.lock);
    for (payload = s_memory.payloads; payload != NULL;
         payload = payload->next) {
        if (payload->data == data) {
            break;
        }
    }
    if (payload == NULL || payload->transitioning ||
        payload->budget_role != ESP32_MQUICKJS_MEMORY_BUDGET_NONE || owner == NULL ||
        strcmp(payload->owner, owner) != 0) {
        taskEXIT_CRITICAL(&s_memory.lock);
        memory_note_failure();
        return NULL;
    }
    payload->transitioning = true;
    old_size = payload->size;
    old_external = payload->external;
    taskEXIT_CRITICAL(&s_memory.lock);

    next = memory_realloc_classified(data, size, memory_class);
    if (next == NULL) {
        taskENTER_CRITICAL(&s_memory.lock);
        payload->transitioning = false;
        taskEXIT_CRITICAL(&s_memory.lock);
        return NULL;
    }
    next_external = memory_is_external(next);
    taskENTER_CRITICAL(&s_memory.lock);
    (void)memory_account_remove_locked(
        payload->owner, payload->memory_class, old_external, old_size);
    (void)memory_account_add_locked(payload->owner, memory_class,
                                    next_external, size);
    payload->data = next;
    payload->size = size;
    payload->memory_class = memory_class;
    payload->external = next_external;
    payload->transitioning = false;
    taskEXIT_CRITICAL(&s_memory.lock);
    return next;
}

void esp32_mquickjs_memory_payload_free(void *data)
{
    esp32_mquickjs_memory_payload_t **cursor;
    esp32_mquickjs_memory_payload_t *payload;

    if (data == NULL) {
        return;
    }
    taskENTER_CRITICAL(&s_memory.lock);
    cursor = &s_memory.payloads;
    while (*cursor != NULL && (*cursor)->data != data) {
        cursor = &(*cursor)->next;
    }
    payload = *cursor;
    if (payload == NULL) {
        taskEXIT_CRITICAL(&s_memory.lock);
        heap_caps_free(data);
        return;
    }
    if (payload->transitioning) {
        taskEXIT_CRITICAL(&s_memory.lock);
        return;
    }
    *cursor = payload->next;
    esp32_mquickjs_memory_payload_t saved = *payload;
    taskEXIT_CRITICAL(&s_memory.lock);
    heap_caps_free(saved.data);
    heap_caps_free(payload);
    /* A blocked/reentrant allocator must still see these bytes reserved. */
    taskENTER_CRITICAL(&s_memory.lock);
    (void)memory_account_remove_locked(saved.owner, saved.memory_class,
        saved.external, saved.size);
    if (saved.budget_role != ESP32_MQUICKJS_MEMORY_BUDGET_NONE) {
        size_t bytes[2];
        if (memory_wireless_bytes(saved.size, saved.external, saved.metadata_external, bytes))
            (void)esp32_mquickjs_memory_budget_release(&s_memory.wireless,
                saved.budget_role, bytes);
    }
    taskEXIT_CRITICAL(&s_memory.lock);
}

static esp32_mquickjs_memory_block_t *memory_block_metadata_alloc(void)
{
    esp32_mquickjs_memory_block_t *block = NULL;

    if (memory_has_psram()) {
        block = heap_caps_calloc(
            1, sizeof(*block), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    }
    if (block == NULL) {
        block = heap_caps_calloc(
            1, sizeof(*block), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    return block;
}

static bool memory_class_is_explicitly_pinned(
    esp32_mquickjs_memory_class_t memory_class)
{
    return memory_class == ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL ||
           memory_class == ESP32_MQUICKJS_MEMORY_DMA_INTERNAL;
}

static bool memory_class_is_movable(esp32_mquickjs_memory_class_t memory_class)
{
    return memory_class == ESP32_MQUICKJS_MEMORY_HOT_MOVABLE ||
           memory_class == ESP32_MQUICKJS_MEMORY_COLD_MOVABLE ||
           memory_class == ESP32_MQUICKJS_MEMORY_CACHE_EVICTABLE;
}

static bool memory_add_block(esp32_mquickjs_memory_block_t *block)
{
    bool added;

    taskENTER_CRITICAL(&s_memory.lock);
    added = memory_account_add_locked(
        block->owner, block->memory_class, block->external, block->size);
    if (!added) {
        taskEXIT_CRITICAL(&s_memory.lock);
        return false;
    }
    block->last_used = ++s_memory.use_sequence;
    block->next = s_memory.blocks;
    s_memory.blocks = block;
    taskEXIT_CRITICAL(&s_memory.lock);
    return true;
}

esp32_mquickjs_memory_block_t *esp32_mquickjs_memory_block_alloc(
    const char *owner,
    size_t size,
    esp32_mquickjs_memory_class_t memory_class,
    esp32_mquickjs_memory_relocated_fn relocated,
    void *opaque)
{
    esp32_mquickjs_memory_block_t *block;
    void *data;

    if (owner == NULL || owner[0] == '\0' ||
        (!memory_class_is_movable(memory_class) &&
        !memory_class_is_explicitly_pinned(memory_class) &&
        memory_class != ESP32_MQUICKJS_MEMORY_DMA_EXTERNAL &&
        memory_class != ESP32_MQUICKJS_MEMORY_EXTERNAL &&
        memory_class != ESP32_MQUICKJS_MEMORY_DEFAULT)) {
        return NULL;
    }
    data = memory_alloc_classified(size, memory_class, false);
    if (data == NULL) {
        return NULL;
    }
    block = memory_block_metadata_alloc();
    if (block == NULL) {
        heap_caps_free(data);
        memory_note_failure();
        return NULL;
    }
    block->data = data;
    block->size = size == 0 ? 1U : size;
    block->owner = owner;
    block->memory_class = memory_class;
    block->relocated = relocated;
    block->opaque = opaque;
    block->external = memory_is_external(data);
    if (!memory_add_block(block)) {
        heap_caps_free(data);
        heap_caps_free(block);
        memory_note_failure();
        return NULL;
    }
    if (relocated != NULL) {
        relocated(opaque, data, block->size);
    }
    return block;
}

bool esp32_mquickjs_memory_block_resize(esp32_mquickjs_memory_block_t *block,
                                       size_t size)
{
    void *next;
    size_t old_size;
    bool old_external;

    if (block == NULL) {
        return false;
    }
    taskENTER_CRITICAL(&s_memory.lock);
    if (block->borrows != 0 || block->transitioning) {
        taskEXIT_CRITICAL(&s_memory.lock);
        return false;
    }
    block->transitioning = true;
    old_size = block->size;
    old_external = block->external;
    taskEXIT_CRITICAL(&s_memory.lock);

    next = memory_realloc_classified(
        block->data,
        size,
        old_external && memory_class_is_movable(block->memory_class)
            ? ESP32_MQUICKJS_MEMORY_COLD_MOVABLE
            : block->memory_class);
    if (next == NULL && size != 0) {
        taskENTER_CRITICAL(&s_memory.lock);
        block->transitioning = false;
        taskEXIT_CRITICAL(&s_memory.lock);
        return false;
    }
    taskENTER_CRITICAL(&s_memory.lock);
    (void)memory_account_remove_locked(
        block->owner, block->memory_class, old_external, old_size);
    block->data = next;
    block->size = size;
    block->external = memory_is_external(next);
    (void)memory_account_add_locked(
        block->owner, block->memory_class, block->external, block->size);
    block->last_used = ++s_memory.use_sequence;
    taskEXIT_CRITICAL(&s_memory.lock);
    if (block->relocated != NULL) {
        block->relocated(block->opaque, next, size);
    }
    taskENTER_CRITICAL(&s_memory.lock);
    block->transitioning = false;
    taskEXIT_CRITICAL(&s_memory.lock);
    return true;
}

