99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_memory.c
void *esp32_mquickjs_memory_block_borrow(esp32_mquickjs_memory_block_t *block)
{
    void *data = NULL;

    if (block == NULL) {
        return NULL;
    }
    taskENTER_CRITICAL(&s_memory.lock);
    if (!block->transitioning && block->data != NULL &&
        block->borrows != UINT16_MAX) {
        block->borrows++;
        block->last_used = ++s_memory.use_sequence;
        data = block->data;
    }
    taskEXIT_CRITICAL(&s_memory.lock);
    return data;
}

void esp32_mquickjs_memory_block_release(esp32_mquickjs_memory_block_t *block)
{
    if (block == NULL) {
        return;
    }
    taskENTER_CRITICAL(&s_memory.lock);
    if (block->borrows > 0) {
        block->borrows--;
        block->last_used = ++s_memory.use_sequence;
    }
    taskEXIT_CRITICAL(&s_memory.lock);
}

size_t esp32_mquickjs_memory_block_size(
    const esp32_mquickjs_memory_block_t *block)
{
    size_t size = 0;

    if (block == NULL) {
        return 0;
    }
    taskENTER_CRITICAL(&s_memory.lock);
    if (!block->transitioning) {
        size = block->size;
    }
    taskEXIT_CRITICAL(&s_memory.lock);
    return size;
}

bool esp32_mquickjs_memory_block_free(esp32_mquickjs_memory_block_t *block)
{
    esp32_mquickjs_memory_block_t **cursor;

    if (block == NULL) {
        return true;
    }
    taskENTER_CRITICAL(&s_memory.lock);
    if (block->borrows != 0 || block->transitioning) {
        taskEXIT_CRITICAL(&s_memory.lock);
        return false;
    }
    cursor = &s_memory.blocks;
    while (*cursor != NULL && *cursor != block) {
        cursor = &(*cursor)->next;
    }
    if (*cursor != block) {
        taskEXIT_CRITICAL(&s_memory.lock);
        return false;
    }
    *cursor = block->next;
    (void)memory_account_remove_locked(
        block->owner, block->memory_class, block->external, block->size);
    taskEXIT_CRITICAL(&s_memory.lock);
    heap_caps_free(block->data);
    heap_caps_free(block);
    return true;
}

static esp32_mquickjs_memory_block_t *memory_oldest_candidate(bool evict)
{
    esp32_mquickjs_memory_block_t *candidate = NULL;
    esp32_mquickjs_memory_block_t *block;

    taskENTER_CRITICAL(&s_memory.lock);
    for (block = s_memory.blocks; block != NULL; block = block->next) {
        bool eligible = !block->transitioning && block->borrows == 0 &&
                        block->data != NULL && !block->external;

        if (evict) {
            eligible = eligible &&
                       block->memory_class ==
                           ESP32_MQUICKJS_MEMORY_CACHE_EVICTABLE;
        } else {
            eligible = eligible &&
                       memory_class_is_movable(block->memory_class);
        }
        if (eligible &&
            (candidate == NULL || block->last_used < candidate->last_used)) {
            candidate = block;
        }
    }
    if (candidate != NULL) {
        candidate->transitioning = true;
    }
    taskEXIT_CRITICAL(&s_memory.lock);
    return candidate;
}

static bool memory_migrate_one(void)
{
    esp32_mquickjs_memory_block_t *block = memory_oldest_candidate(false);
    void *next;
    size_t size;

    if (block == NULL) {
        return false;
    }
    size = block->size;
    next = heap_caps_realloc(block->data, size,
                             MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    taskENTER_CRITICAL(&s_memory.lock);
    if (next != NULL) {
        (void)memory_account_remove_locked(
            block->owner, block->memory_class, false, size);
        (void)memory_account_add_locked(
            block->owner, block->memory_class, true, size);
        block->data = next;
        block->external = true;
        block->last_used = ++s_memory.use_sequence;
        if (s_memory.migration_count != UINT32_MAX) {
            s_memory.migration_count++;
        }
        s_memory.migration_bytes += size;
    }
    taskEXIT_CRITICAL(&s_memory.lock);
    if (next != NULL && block->relocated != NULL) {
        block->relocated(block->opaque, next, size);
    }
    taskENTER_CRITICAL(&s_memory.lock);
    block->transitioning = false;
    taskEXIT_CRITICAL(&s_memory.lock);
    return next != NULL;
}

static bool memory_evict_one(void)
{
    esp32_mquickjs_memory_block_t *block = memory_oldest_candidate(true);
    void *data;
    size_t size;

    if (block == NULL) {
        return false;
    }
    data = block->data;
    size = block->size;
    taskENTER_CRITICAL(&s_memory.lock);
    block->data = NULL;
    block->size = 0;
    (void)memory_account_remove_locked(
        block->owner, block->memory_class, block->external, size);
    block->external = false;
    block->last_used = ++s_memory.use_sequence;
    if (s_memory.eviction_count != UINT32_MAX) {
        s_memory.eviction_count++;
    }
    taskEXIT_CRITICAL(&s_memory.lock);
    heap_caps_free(data);
    if (block->relocated != NULL) {
        block->relocated(block->opaque, NULL, 0);
    }
    taskENTER_CRITICAL(&s_memory.lock);
    block->transitioning = false;
    taskEXIT_CRITICAL(&s_memory.lock);
    return true;
}

void esp32_mquickjs_memory_maintain(void)
{
    unsigned actions = 0;

    esp32_mquickjs_memory_init();
    taskENTER_CRITICAL(&s_memory.lock);
    if (s_memory.maintaining) {
        taskEXIT_CRITICAL(&s_memory.lock);
        return;
    }
    s_memory.maintaining = true;
    taskEXIT_CRITICAL(&s_memory.lock);

    while (memory_pressure_now() != ESP32_MQUICKJS_MEMORY_PRESSURE_NORMAL &&
           actions < MEMORY_MAX_ACTIONS_PER_PASS) {
        bool changed = false;

        if (memory_has_psram()) {
            changed = memory_migrate_one();
        }
        if (!changed &&
            memory_pressure_now() ==
                ESP32_MQUICKJS_MEMORY_PRESSURE_CRITICAL) {
            changed = memory_evict_one();
        }
        if (!changed) {
            break;
        }
        actions++;
    }
    taskENTER_CRITICAL(&s_memory.lock);
    s_memory.maintaining = false;
    taskEXIT_CRITICAL(&s_memory.lock);
}

void esp32_mquickjs_memory_release_generation(void)
{
    esp32_mquickjs_memory_block_t *blocks;
    esp32_mquickjs_memory_block_t *block;

    taskENTER_CRITICAL(&s_memory.lock);
    blocks = s_memory.blocks;
    s_memory.blocks = NULL;
    for (block = blocks; block != NULL; block = block->next) {
        if (block->data != NULL) {
            (void)memory_account_remove_locked(
                block->owner, block->memory_class, block->external,
                block->size);
        }
    }
    taskEXIT_CRITICAL(&s_memory.lock);

