99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_memory.c
    /*
     * JavaScript finalizers normally unregister their blocks first. MQuickJS
     * may still leave unreachable user objects until context teardown, so the
     * manager owns this final backstop after JS_FreeContext has invalidated
     * every owner and relocation callback.
     */
    while (blocks != NULL) {
        esp32_mquickjs_memory_block_t *next = blocks->next;

        heap_caps_free(blocks->data);
        heap_caps_free(blocks);
        blocks = next;
    }
}

bool esp32_mquickjs_memory_reserve_internal_dma(
    esp32_mquickjs_memory_dma_reservation_t *reservation,
    const char *owner,
    size_t total_bytes,
    size_t largest_block_bytes)
{
    multi_heap_info_t internal;
    multi_heap_info_t dma;
    size_t reserve;
    size_t required_bytes;
    size_t required_largest;
    bool accepted = false;

    esp32_mquickjs_memory_init();
    if (reservation == NULL || owner == NULL || owner[0] == '\0' ||
        total_bytes == 0 || largest_block_bytes == 0 ||
        largest_block_bytes > total_bytes) {
        return false;
    }
    memory_heap_info(&internal, &dma);
    taskENTER_CRITICAL(&s_memory.lock);
    reserve = s_memory.internal_reserve_bytes;
    if (total_bytes <= SIZE_MAX - s_memory.dma_accounting.pending_bytes &&
        largest_block_bytes <=
            SIZE_MAX - s_memory.dma_accounting.pending_largest_bytes) {
        required_bytes = total_bytes + s_memory.dma_accounting.pending_bytes;
        required_largest = largest_block_bytes +
                           s_memory.dma_accounting.pending_largest_bytes;
        if (dma.largest_free_block >= required_largest &&
            internal.total_free_bytes >= required_bytes &&
            internal.total_free_bytes - required_bytes >= reserve / 2U) {
            accepted = esp32_mquickjs_memory_dma_accounting_reserve(
                &s_memory.dma_accounting, reservation, total_bytes,
                largest_block_bytes);
            if (accepted) {
                reservation->owner = owner;
            }
        }
    }
    taskEXIT_CRITICAL(&s_memory.lock);
    if (!accepted) {
        memory_note_failure();
        return false;
    }
    return true;
}

bool esp32_mquickjs_memory_commit_driver_pinned(
    esp32_mquickjs_memory_dma_reservation_t *reservation,
    size_t driver_pinned_bytes)
{
    bool committed;

    taskENTER_CRITICAL(&s_memory.lock);
    committed = reservation != NULL && reservation->owner != NULL &&
        esp32_mquickjs_memory_owner_add(
            &s_memory.owner_accounting, reservation->owner,
            ESP32_MQUICKJS_MEMORY_DMA_INTERNAL,
            ESP32_MQUICKJS_MEMORY_REGION_INTERNAL,
            driver_pinned_bytes, 1);
    if (committed) {
        committed = esp32_mquickjs_memory_dma_accounting_commit(
            &s_memory.dma_accounting, reservation, driver_pinned_bytes);
        if (!committed) {
            (void)esp32_mquickjs_memory_owner_remove(
                &s_memory.owner_accounting, reservation->owner,
                ESP32_MQUICKJS_MEMORY_DMA_INTERNAL,
                ESP32_MQUICKJS_MEMORY_REGION_INTERNAL,
                driver_pinned_bytes, 1);
        }
    }
    taskEXIT_CRITICAL(&s_memory.lock);
    return committed;
}

bool esp32_mquickjs_memory_commit_staging_pinned(
    esp32_mquickjs_memory_dma_reservation_t *reservation,
    size_t staging_pinned_bytes,
    uint32_t dma_staging_pools)
{
    bool committed;

    taskENTER_CRITICAL(&s_memory.lock);
    committed = reservation != NULL && reservation->owner != NULL &&
        esp32_mquickjs_memory_owner_add(
            &s_memory.owner_accounting, reservation->owner,
            ESP32_MQUICKJS_MEMORY_DMA_INTERNAL,
            ESP32_MQUICKJS_MEMORY_REGION_INTERNAL,
            staging_pinned_bytes, dma_staging_pools);
    if (committed) {
        committed = esp32_mquickjs_memory_dma_accounting_commit_staging(
            &s_memory.dma_accounting, reservation, staging_pinned_bytes,
            dma_staging_pools);
        if (!committed) {
            (void)esp32_mquickjs_memory_owner_remove(
                &s_memory.owner_accounting, reservation->owner,
                ESP32_MQUICKJS_MEMORY_DMA_INTERNAL,
                ESP32_MQUICKJS_MEMORY_REGION_INTERNAL,
                staging_pinned_bytes, dma_staging_pools);
        }
    }
    taskEXIT_CRITICAL(&s_memory.lock);
    return committed;
}

bool esp32_mquickjs_memory_release_driver_pinned(
    esp32_mquickjs_memory_dma_reservation_t *reservation)
{
    bool released;
    const char *owner;
    size_t bytes;
    uint32_t blocks;

    taskENTER_CRITICAL(&s_memory.lock);
    owner = reservation == NULL ? NULL : reservation->owner;
    bytes = reservation == NULL ? 0 :
        reservation->driver_pinned_bytes +
        reservation->staging_pinned_bytes;
    blocks = reservation == NULL ? 0 :
        (reservation->driver_pinned_bytes != 0 ? 1U : 0U) +
        reservation->dma_staging_pools;
    released = esp32_mquickjs_memory_dma_accounting_release(
        &s_memory.dma_accounting, reservation);
    if (released && bytes != 0) {
        released = esp32_mquickjs_memory_owner_remove(
            &s_memory.owner_accounting, owner,
            ESP32_MQUICKJS_MEMORY_DMA_INTERNAL,
            ESP32_MQUICKJS_MEMORY_REGION_INTERNAL, bytes, blocks);
    }
    taskEXIT_CRITICAL(&s_memory.lock);
    return released;
}

void esp32_mquickjs_memory_reset_counters(void)
{
    taskENTER_CRITICAL(&s_memory.lock);
    s_memory.migration_count = 0;
    s_memory.migration_bytes = 0;
    s_memory.eviction_count = 0;
    s_memory.allocation_failures = 0;
    esp32_mquickjs_memory_budget_reset_counters(&s_memory.wireless);
    taskEXIT_CRITICAL(&s_memory.lock);
}

void esp32_mquickjs_memory_get_status(esp32_mquickjs_memory_status_t *out)
{
    esp32_mquickjs_memory_block_t *block;

    if (out == NULL) {
        return;
    }
    esp32_mquickjs_memory_init();
    memset(out, 0, sizeof(*out));
    out->pressure = memory_pressure_now();
    taskENTER_CRITICAL(&s_memory.lock);
    out->internal_reserve_bytes = s_memory.internal_reserve_bytes;
    out->dma_largest_reserve_bytes = s_memory.dma_largest_reserve_bytes;
    out->managed_internal_bytes = s_memory.managed_internal_bytes;
    out->managed_psram_bytes = s_memory.managed_psram_bytes;
    out->pinned_bytes = s_memory.managed_pinned_bytes +
                        s_memory.dma_accounting.driver_pinned_bytes +
                        s_memory.dma_accounting.staging_pinned_bytes;
    out->driver_pinned_bytes = s_memory.dma_accounting.driver_pinned_bytes;
    out->staging_pinned_bytes = s_memory.dma_accounting.staging_pinned_bytes;
    out->dma_staging_pools = s_memory.dma_accounting.dma_staging_pools;
    out->pending_dma_reservation_bytes =
        s_memory.dma_accounting.pending_bytes;
    out->migration_count = s_memory.migration_count;
    out->migration_bytes = s_memory.migration_bytes;
    out->eviction_count = s_memory.eviction_count;
    out->allocation_failures = s_memory.allocation_failures;
    out->wireless = s_memory.wireless;
    out->allocation_count = esp32_mquickjs_memory_owner_snapshot(
        &s_memory.owner_accounting, out->allocations,
        ESP32_MQUICKJS_MEMORY_MAX_OWNER_ENTRIES);
    for (block = s_memory.blocks; block != NULL; block = block->next) {
        if (!block->transitioning && block->borrows == 0 &&
            block->data != NULL && memory_class_is_movable(block->memory_class)) {
            out->movable_idle_bytes += block->size;
        }
    }
    taskEXIT_CRITICAL(&s_memory.lock);
}

const char *esp32_mquickjs_memory_class_name(
    esp32_mquickjs_memory_class_t memory_class)
{
    switch (memory_class) {
    case ESP32_MQUICKJS_MEMORY_PINNED_INTERNAL:
        return "pinned-internal";
    case ESP32_MQUICKJS_MEMORY_DMA_INTERNAL:
        return "dma-internal";
    case ESP32_MQUICKJS_MEMORY_DMA_EXTERNAL:
        return "dma-external";
    case ESP32_MQUICKJS_MEMORY_EXTERNAL:
        return "external";
    case ESP32_MQUICKJS_MEMORY_HOT_MOVABLE:
        return "hot-movable";
    case ESP32_MQUICKJS_MEMORY_COLD_MOVABLE:
        return "cold-movable";
    case ESP32_MQUICKJS_MEMORY_CACHE_EVICTABLE:
        return "cache-evictable";
    case ESP32_MQUICKJS_MEMORY_DEFAULT:
    default:
        return "pinned-internal";
    }
}

const char *esp32_mquickjs_memory_region_name(uint8_t region)
{
    return region == ESP32_MQUICKJS_MEMORY_REGION_PSRAM
               ? "psram"
               : "internal";
}

const char *esp32_mquickjs_memory_pressure_name(
    esp32_mquickjs_memory_pressure_t pressure)
{
    switch (pressure) {
    case ESP32_MQUICKJS_MEMORY_PRESSURE_NORMAL:
        return "normal";
    case ESP32_MQUICKJS_MEMORY_PRESSURE_GUARDED:
        return "guarded";
    case ESP32_MQUICKJS_MEMORY_PRESSURE_CRITICAL:
        return "critical";
    default:
        return "critical";
    }
}
